Repository: 84000/data-translation-memory
Catalog: toh667-v3.tmx
Source language: bo
Languages: en

source: དཔལ་ནག་པོ་ཆེན་པོའི་རྒྱུད།
en: The Tantra of Glorious Mahākāla

source: དབང་གི་རྟ་མཆོག་སྐུ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the body of Enthralling Paramāśva.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། ཤར་ལྷོའི་དུར་ཁྲོད་ཆེན་པོ་ཧ་ཧ་དྲག་ཏུ་རྒོད་པའི་གནས་ཤིང་ཙནྡན་གྱི་ནགས་ཚལ་རབ་ཏུ་དགའ་བའི་མིང་ཞེས་བྱ་བ་མི་མ་ཡིན་ཕོ་མོ་མང་པོ་འདུས་པའི་ཕོ་བྲང་དུ། དཔལ་ནག་པོ་ཆེན་པོ་ཞེས་བྱ་བ་བི་ནཱ་ཡ་ཀ་ལ་སོགས་ཏེ། དེའི་ཚེ་འཁོར་གདུག་པ་ཅན་རྣམས་ཀྱི་དབུས་ན། སྐྱེ་འགྲོ་སེམས་ཅན་རྣམས་ཀྱི་སྲོག་དབུགས་ལ་དབང་བྱེད་པའི་ནག་པོ་ཆེན་པོ་ཞེས་བྱ་བ་ཅིག་ཡོད་དེ།
en: Thus did I hear at one time. At the southeastern charnel ground Aṭṭahāsa, in the sandalwood grove called Joyous, the vināyaka Glorious Mahākāla was present in the palace where a multitude of male and female nonhuman beings gathered. At the time, in the midst of a retinue of cruel beings, he was known as “Mahākāla Who Controls the Life Breath of Living Beings.”

source: དེའི་ཚེ་དེའི་དུས་ན་ནུབ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན། མཐར་བྱེད་རྟའི་རྒྱལ་པོ་ཞེས་བྱ་བ། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོགས་པའི་འཁོར་གྱིས་བསྐོར་ཏེ། དྲེགས་པ་ཅན་འདུལ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་ལྕགས་ཀྱུའི་ཕྱག་རྒྱ་བཅས་ནས། ཨོཾ་བཛྲ་ཀྲོ་དྷ་ཧ་ཡ་གྲཱི་བ་ཧཱུྃ་ཧུ་ལུ་ཧུ་ལུ་ཧཱུྃ་བྃ་ཞེས་བརྗོད་པས་དུར་ཁྲོད་ཧ་ཧ་དྲག་ཏུ་རྒོད་པའི་གནས་ནག་པོ་ཆེན་པོ། རང་དབང་མེད་པར་མཐར་བྱེད་རྟའི་རྒྱལ་པོའི་མངོན་དུ་བྱུང་སྟེ་
en: At the same time, in the western world system, the King of Horses, Bringer of Death, was surrounded by an assembly of the Four Great Kings and the rest. He entered the absorption that tames arrogant beings while using the hook mudrā and reciting the mantra oṃ vajrakrodha hayagrīva hūṁ hulu hulu hūṁ vaṃ. Powerless to do otherwise, Mahākāla appeared before the King of Horses, Bringer of Death, from his abode in the Aṭṭahāsa charnel ground.

source: ལས་ཅི་བྱ་ཟེར་ཞིང་རང་རྟགས་སྲོག་གི་སྙིང་པོ་འདི་མདོངས་གསོལ་དུ་ཕུལ་བ། ཨོྃ་བཛྲ་མ་ཧཱ་ཀཱ་ལ་ཀྵིཾ་ཀྵེ་ཏྲ་བིགྷྣ་ན་བི་ནཱ་ཡ་ཀ་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཅེས་ཕུལ་ལོ། །
en: “What can I do for you?” he asked, and politely offered his own mark, the essence of his life force, oṃ vajra­mahākāla kṣiṃ kṣetra­vighnān vināyaka hūṁ hūṁ phaṭ.

source: དཔལ་ནག་པོ་ཆེན་པོའི་རྒྱུད་ལས་གླེང་གཞིའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: This is chapter 1 in “The Tantra of Glorious Mahākāla,” the “Introduction.”

source: དེ་ནས་རྒྱལ་པོ་མིག་མི་བཟང་གིས་མཐར་བྱེད་རྟའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Chapter 2: The Worship Rite and Sādhana Then King Virūpakṣa supplicated the King of Horses, Bringer of Death, with the following verses:

source: ཨེ་མ་པདྨ་ཁྲོས་པའི་བདག །ནག་པོ་ཆེན་པོ་དྲག་ཤུལ་ཅན། །གསང་བའི་སྒྲུབ་པ་བཤད་དུ་གསོལ། །
en: “O Wrathful Lotus Lord, Please explain the secret practice For the terrible form of Mahākāla. Regarding the acts for practicing the Lord,

source: མགོན་པོ་སྒྲུབ་པར་བྱ་བ་གང་། །བསད་ཅིང་ལུས་སྲོག་དབྱེ་བ་དང་། །མ་གྲུབ་ཤི་ས་བསྟན་པ་དང་། །མགོན་པོའི་རྟགས་དང་སེར་བ་རྣམས། །རྟ་མཆོག་ཆེན་པོས་བདག་ལ་སྩོལ། །
en: “Great Supreme Horse, please tell us about Killing and severing the life force and the body, Instructions for when the rite does not work, and the place of death, The Lord’s signs, and casting hailstorms.”

source: ཞེས་ཞུས་པས། དེ་ནས་པདྨ་ཁྲོས་པ་ཡིས། ནག་པོའི་སྒྲུབ་ཐབས་ཆེད་དུ་བརྗོད། །
en: Wrathful Lotus then gave the following teaching On the Black One’s sādhana: “For a mantrin who holds the samayas

source: དམ་ཚིག་ལྡན་པའི་སྔགས་པ་ཡིས། །སངས་རྒྱས་བསྟན་པ་བསྲུང་སླད་དུ། །གཟའ་སྐར་ཚེས་གྲངས་ཤིས་པ་ལ། །དུར་ཁྲོད་ལ་སོགས་ཤིང་གཅིག་ཏུ། །བསོད་ནམས་ཚོགས་ནི་བསགས་བྱས་ལ། །ནག་པོ་ཆེན་པོ་བསྒྲུབ་པར་བྱ། །
en: To protect the teachings of the Buddha, “They should gather the accumulation of merit During an auspicious planetary conjunction and lunar day In a place with a single tree such as a charnel ground And perform Mahākāla’s sādhana.

source: ཕུངས་འམ་ས་ནག་དག་ལ་ནི། །སྟེགས་བུ་གྲུ་བཞི་བྱས་ནས་ནི། །དྲི་སྤོས་ཁྲག་གིས་ཆག་ཆག་བྱ། །
en: “Construct a square altar using Soil from a mound or black soil, and Sprinkle it with perfume, incense, and blood.

source: དབུས་སུ་གྲུ་གསུམ་ཟླ་གམ་ལྡན། །
en: In the middle, draw a triangle with a half moon

source: ཕྱི་རོལ་པདྨ་འདབ་བརྒྱད་བྲི། །དེ་དབུས་ཐོད་ཆེན་ནང་དུ་ནི། །ཤ་ལྔ་སྙིང་སྣས་བརྒྱན་པ་ཡིས། །གཏོར་མ་བཤོས་བུ་ཁྲུ་གང་ཚད། །
en: “Surrounded by a lotus with eight petals. There should be a large skull in the middle of that, containing A bali offering and offering cake one cubit high, Adorned with the five meats and various bodily essences.

source: དེ་ལ་མདའ་གཟུགས་དམར་ནག་དར། །གྲི་སྙིང་ཙ་ཀ་ལི་ཡང་གཟུགས། །དེ་ཉིད་མགོན་པོའི་རྟེན་དུ་བཞག །
en: “One should insert an arrow and a dark red cloth into it, Along with a knife, a heart, and a small image of the deity. Set this out as the Lord’s seat.

source: ཌ་མ་རུ་ཡི་པགས་པའི་ནང་། །མགོན་པོའི་སྲོག་སྔགས་བྲི་བར་བྱ། །
en: Write the Lord’s life-force mantra “On the inside of the skin of the ḍamaru.

source: ལྡོ་ཡི་ནང་དུ་བླ་རྡོས་དྲིལ། །
en: Roll it up with a soul stone and place it inside.

source: སྤོས་དང་རྒྱུན་གཏོར་གཏང་བར་བྱ། །
en: Present an offering of incense and the daily bali. Set out the common offering to the Three Jewels.

source: དཀོན་མཆོག་སྤྱི་ལ་མཆོད་པ་བཤམ། །དེ་ནས་པདྨར་བདག་བསྒོམས་ལ། །ཐུགས་ཀའི་ཧྲཱིཿལས་འོད་འཕྲོས་པས། །བླ་མ་སངས་རྒྱས་ལ་སོགས་པ། །རང་གི་མདུན་དུ་བསམ་བྱས་ལ། །མཆོད་པ་རྣམ་ལྔ་དབུལ་བར་བྱ། །
en: “Visualize oneself on a lotus, Imagine light rays radiating from the hṛīḥ at the heart, Make the guru, the Buddha, and so forth Appear right before oneself, “And offer them five offerings.

source: རྣམ་དག་བདུན་གྱི་འོག་ཏུ་ནི། །ཚད་མེད་བཞི་པོ་བསྒོམ་པར་བྱ། །
en: After the sevenfold purification rite, Meditate on the four immeasurables, beginning with Equanimity and so forth, and the syllables vaṃ, raṃ, and tri.

source: བཏང་སྙོམས་ལ་སོགས་པྃ་རྃ་ཏྲི། །པད་སྟེངས་ཡི་གེ་ཧཱུཾ་ལས་ནི། །ནག་པོ་ཞལ་གཅིག་ཕྱག་དྲུག་པ། །གྲི་གུག་ཕྲེང་བ་ཌཱ་མ་རུ། །ཐོད་པ་མདུང་དང་ཞགས་པ་བསྣམས། །གཡས་གཡོན་རིམ་པས་བསྣམས་པའོ། །
en: “Out of the syllable hūṁ on top of the lotus Emerges Mahākāla with a black face and six arms, Holding a hooked knife, rosary, ḍamaru, Skull, spear, and noose “In his right hands and left hands respectively.

source: སྦྲུལ་དང་རིན་ཆེན་རྒྱན་གྱིས་བརྒྱན། །
en: He is adorned with snakes and jewelry.

source: སྐུ་སྨད་བ་ཏི་ཁྲ་བོ་གསོལ། །
en: He wears a multicolored garment on his lower body

source: སྟག་ལྤགས་ཞིང་གི་ཤམ་ཐབས་ཅན། །གཏུམ་པོ་སྤྱན་གསུམ་མཆེ་བ་གཙིགས། །དཔྲལ་བར་དྲི་ཡི་ཐིག་ལེས་བརྒྱན། །
en: And a lower garment made of a tiger’s skin. “He has three fierce eyes and bares his fangs. His forehead is adorned with a drop of filth.

source: སྤྱི་གཙུག་མི་བསྐྱོད་སྤྲུལ་སྐུ་བརྟན། །
en: Akṣobhya’s emanation body sits on his crown.

source: དེ་ལྟར་བདག་མདུན་གསལ་བསྒོམས་ནས། །
en: Visualize him clearly before oneself while

source: སྤྱན་དྲངས་མཆོད་དང་བཟླས་པ་བྱ། །
en: “Performing the invitation, offering, and mantra recitation.

source: གཏོར་མ་པཱུ་ཛ་ལ་སོགས་པས། །ནག་པོ་ཆེ་ལ་སྦྱིན་པར་བྱ། །
en: Present gifts to Mahākāla using the Bali offering, offering ceremony, and the like.

source: མགོན་པོའི་ཐུགས་ཀའི་ཧཱུྃ་ལས་ནི། །སྲོག་གི་ཡི་གེས་གཡས་ནས་བསྐོར། །
en: The syllables of the vitality mantra emerge from “The hūṁ at the Lord’s heart and circle clockwise as one

source: ཁོར་ཡུག་དག་གིས་བཟླས་པར་བྱ། །
en: Recites the following mantra in continuous rounds:

source: ཨོཾ་བཛྲ་མ་ཧཱ་ཀཱ་ལ་ཀྵིཾ་ཀྵེ་ཏྲ་བིགྷྣཱན་བི་ནཱ་ཡ་ཀ་ཧཱུྃ་ཧཱུྃ་ཕཊ། དེ་སྐད་ཅེས་ནི་རབ་བརྗོད་པས། །ནག་པོ་གྲུབ་པའི་རྟགས་རྣམས་འབྱུང་། །
en: oṃ vajra­mahākāla kṣiṃ kṣetra­vighnān vināyaka hūṁ hūṁ phaṭ | An excellent recitation practice will result in signs That one has accomplished the Black One’s siddhi.”

source: དཔལ་ནག་པོ་ཆེན་པོའི་རྒྱུད་ལས་བསྙེན་ཅིང་བསྒྲུབ་པའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།
en: This is chapter 2 in “The Tantra of Glorious Mahākāla” on “The Worship Rite and Sādhana.” Chapter 3: Severing the Life Force from the Body

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །སངས་རྒྱས་བསྟན་པ་བཤིག་པ་དང་། །རྣལ་འབྱོར་བར་ཆད་བྱེད་པ་རྣམས། །ནག་པོ་ཆེན་པོས་བསྒྲལ་འདོད་ན། །
en: “Now I will teach the following: If one wants beings who destroy the Buddhist teachings Or create obstacles for yogins To be liberated by Mahākāla,

source: སྟེགས་བུ་གྲུ་བཞི་བྱས་ནས་ཀྱང་། །དྲག་པོ་ཨེ་ཡི་ནང་དུ་ནི། །ཕོ་མོ་རབས་ཆད་ཐོད་པའི་ནང་། །གཟུགས་ནི་སྤྲ་ཚིལ་དག་ལ་བྱ། །
en: “Make a square altar again and place The skulls of a man and woman with no descendants With wax effigies inside of them Inside of a fierce triangular diagram.

source: མིང་རུས་དག་ནི་བཀོད་ནས་ཀྱང་། །བསད་དང་ན་བ་སྐབས་དང་སྦྱར། །
en: “Affix their name and clan name and Add the word ‘kill’ or ‘infect’ as appropriate.

source: མགོན་པོའི་སྐུ་དང་དམ་རྫས་རྣམས། །ཁ་དང་ཁ་ལ་དགོད་པར་བྱ། །
en: Set up the image of the Lord and the samaya substances, And place some in each of their mouths.

source: ཕག་ཐོད་ནང་དུ་ཐུན་རྫས་བླུགས། །
en: “Place powerful substances in a boar’s skull

source: རྟ་གཏོར་རྒྱུན་གཏོར་གཡས་དང་གཡོན། །གསང་སྔགས་འདི་ཡིས་གསད་པར་བྱ། །
en: And set the continual and daily bali offerings on the left and right.

source: ཨོཾ་བཛྲ་མ་ཧཱ་ཀཱ་ལ་ཀྵིཾ་ཀྵེ་ཏྲ་ཡ་བིགྷྣཱ་ན་བི་ནཱ་ཡ་ཀ་ཧཱུྃ་ཧཱུྃ་ཕཊ། ཨོཾ་མ་ཧཱ་ཀཱ་ལ་ཡ་ཤཱ་ས་ན་ཨུ་པ་ཀ་རི་ཎི་ཨེ་ཥ་ཨ་བཥྩི་མ་ཀཱ་ལོ་ཨ་ཡང་ཨི་དྃ་རཏྣ་ཏྲ་ཡཱ་ཡ་ཨ་པ་ཀཱ་རི་ཎྃ་ཡ་དི་པྲ་ཏི་ཛྙཱ་སྨར་སི་ཏ་དཱ་ཨི་དྃ་དུཥྚན་ཁ་ཁ་ཁཱ་ཧི་ཁཱ་ཧི། མཱ་ར་མཱ་ར། གྷྲྀཧྞ་གྷྲྀཧྞ། བནྡྷ་བནྡྷ། ཧ་ན་ཧ་ན།
en: “Perform the killing rite with the following mantra: oṃ vajramahākāla kṣiṃ kṣetravighnānvināyaka hūṁ hūṁ phaṭ | oṃ mahākālāyaśāsanopakāriṇieṣa apaścimakālo ’yam idaṃ ratnatrayāya apakāriṇaṃ yadi pratijñāṃsmarasi tadā idaṃ duṣṭaṃ kha kha khāhi khāhi | māra māra | ghṛhṇa ghṛhṇa | bandha bandha | hana hana | daha daha | paca paca | dinam ekena māraya hūṁ hūṁ phaṭ phaṭ | hūṁ vināyakavilāsatraṃ vi tri hūṁ ja si ma bu vināyaka create obstacles for the life force of so-and-so whose name has been written ja māraya I implore you! | “Recite the fierce mantra while pelting them with the powerful substances.

source: ད་ཧ་ད་ཧ། པ་ཙ་པ་ཙ། དི་ན་མེ་ཀེ་ན་མཱ་ར་ཡ་ཧཱུཾ་ཧཱུཾ་ཕཊ་ཕཊ། ཧཱུཾ་བི་ནཱ་ཡ་ཀ་པི་ལས་ཏྲྃ་བི་ཏྲི་ཧཱུྃ་ཛ་སི་མ་བུ་བི་ནཱ་ཡ་ཀ་ཨ་མུ་ཀ་བྲི་སྲོག་ཧུར་ཐུམ་ཛ་མཱ་ར་ཡ་རྦད། དྲག་སྔགས་བཟླས་ཤིང་ཐུན་གྱིས་བྲབ། །ཞག་བདུན་བར་དུ་སྨྲ་མི་བྱ། །
en: Do not speak for an entire week.

source: དེ་ལ་རྟགས་རྣམས་རྫོགས་པར་འགྱུར། །
en: At that point, the signs will be directly apparent.”

source: དཔལ་ནག་པོ་ཆེན་པོའི་རྒྱུད་ལས་ལུས་སྲོག་དབྱེ་བའི་ལེའུ་སྟེ་གསུམ་པའོ།། །།
en: This is chapter 3 in “The Tantra of Glorious Mahākāla” on “Severing the Life Force from the Body.” Chapter 4: The Concluding Rite

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །ལས་མཐའ་སྦྱིན་སྲེག་དག་གིས་བརྟུལ། །གྲུ་གསུམ་དབུས་སུ་གདུག་པའི་ཤིང་། །དབུས་སུ་ནག་པོ་འཁོར་བཅས་བསྐྱེད། །
en: “Now I will explain the end of the rite, Which is concluded with a fire offering. Generate Mahākāla with his retinue in the middle Of a triangle of sarala pine branches.

source: ལིང་ག་གཏོར་མ་དམ་རྫས་རྣམས། །ནག་པོའི་ཞལ་དུ་དབུལ་བར་བྱ། །
en: “Place the effigy, bali offering, And ritual substances in Mahākāla’s mouth.

source: སྔགས་འདི་བཟླས་ཤིང་བསྲེག་པར་བྱ། །
en: Recite the mantra while performing the fire offering,

source: ཨགྣེ་ཛྭ་ལ་རྃ་ལས་རྫོགས། །
en: And finish with the phrase agne jvala raṃ.

source: ཐལ་བ་རླུང་དམར་དག་ལ་བསྐུར། །ཨ་མུ་ཀ་ནི་མྱུར་དུ་རློག །
en: “Let the ashes be taken away by a strong wind. The target of the rite will quickly come to ruin.”

source: དཔལ་ནག་པོ་ཆེན་པོའི་རྒྱུད་ལས་མཐའ་བརྟུལ་བའི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: This is chapter 4 in “The Tantra of Glorious Mahākāla” on “The Concluding Rite.” Chapter 5: The Enhancing Rite for When the Rite Does Not Work, and the Mending Rite

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །དེ་ལྟར་བསྒྲུབས་ཀྱང་མ་གྲུབ་ན། །
en: “Next, I shall teach the following: If one performs the practice but it does not work,

source: གཅིག་དང་གཉིས་ལ་ནན་ཏན་བསྐྱེད། །
en: Generate it in earnest once or twice more.

source: དེ་ལྟར་བྱས་ཀྱང་མ་གྲུབ་ན། །
en: If one does that and it still does not work, “Make an image of the Black One out of

source: ས་གསུམ་ཁྲག་གསུམ་དུག་གསུམ་ལ། །ཁྲུ་གང་པ་ཡི་གཟུགས་ཀྱི་ཚད། །
en: The three soils, three bloods, and three types of poison That is one cubit tall, and place it atop two switches So that it hovers over the middle of the triangle. “The painting, samaya substances, and soul stone

source: གྲུ་གསུམ་དབུས་སུ་ནག་པོའི་གཟུགས། །སྤྱི་ཚར་དག་ཏུ་ལྡིང་དུ་གཞུག །
en: Are placed beneath one’s own triangular cushion And should be covered with poison and thorns. Pelt it with powerful substances while reciting this mantra:

source: བྲིས་སྐུ་དམ་རྫས་བླ་རྡོ་རྣམས། །རང་གི་གྲུ་གསུམ་མལ་གྱི་འོག །དུག་དང་ཚེར་མས་སྟེང་ནས་དགབ། །ཐུན་རྫས་བྲབ་ཅིང་སྔགས་འདི་བཟླས། །ཨོྃ་བཛྲ་ཀྲོ་དྷ་ཧ་ཡ་གྲི་བ་ཧཱུྃ་ཧུ་ལུ་ཧུ་ལུ་ཧཱུྃ་ཕཊ། ཕཊ་ཧཱུྃ་ཧཱུྃ་ཀ་ཡ་ནཱ་བི་ནཱན་གྷ་བི་ཏྲ་ཀྵེ་ཀྵིཾ་ལ་ཀཱ་ཧཱ་མ་བཛྲ་ཨོཾ། དེ་སྐད་བརྗོད་ཅིང་ཐུན་གྱིས་བྲབ། །དེ་ལ་རྟགས་རྣམས་རྫོགས་པ་དང་། །དེ་ནས་གསོ་བའི་ཆོ་ག་བྱ། །
en: oṃ vajrakrodha hayagrīva hūṁ hulu hulu hūṁ phaṭ | phaṭ hūṁ hūṁ akayāniv nānghivarteṣk ṃiṣk alākāhamarjav oṃ | “Signs that the rite has worked will become fully apparent while One is pelting it with powerful substances and reciting the mantra. After that, one should perform the mending ritual. Wash the painting, soul stone, and samaya substances “With perfumed water and recite this mantra:

source: བྲིས་སྐུ་བླ་རྡོ་དམ་རྫས་རྣམས། །སྤོས་ཆུས་བཀྲུ་ཞིང་སྔགས་འདི་བཟླས། །ཨོཾ་བཛྲ་མ་ཧཱ་ཀཱ་ལ་ཀྵིཾ་ཀྵེ་ཏྲ་བིགྷྣཱན་བི་ནཱ་ཡ་ཀ་ཧཱུྃ་ཧཱུྃ་ཕཊ་སོས་སོས་སྭཱ་ཧཱ། དེ་སྐད་བྱས་ལ་གནས་སུ་ནི། །མགོན་པོའི་གཟུགས་ཀྱང་སྤོས་ཆུས་བཀྲུ། །གྲུ་གསུམ་དབུས་སུ་བླངས་བྱས་ལ། །དགྲ་བོའི་མིང་རུས་སྙིང་གར་གཞུག །
en: oṃ vajramahākāla kṣiṃ kṣetravighnān vināyaka hūṁ hūṁ phaṭ mend mend svāhā | “Wash the statue of the Lord with perfumed water In the location where you have recited the mantra. Remove it from the middle of the triangle and “Place the enemy’s name and clan name in the heart.

source: ཞག་བདུན་བསྒྲུབས་ལ་དགྲ་ལ་བསྐྱལ། །ཨ་མུ་ཀ་ནི་མྱུར་དུ་བརླག །
en: Perform this practice for seven days, bring it to the enemy, And it will quickly destroy the designated target.”

source: དཔལ་མགོན་པོ་ནག་པོའི་རྒྱུད་ལས་མ་གྲུབ་ན་སྤོགས་པའི་ཆོ་ག་དང་གསོ་བའི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: This is chapter 5 in “The Tantra of Glorious Mahākāla” on “The Enhancing Rite for When the Rite Does Not Work and the Mending Rite.” Chapter 6: A Series of Signs of Accomplishment “Now, I will teach the following:

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །བྱ་ནག་འཕུར་ཞིང་ལྡིང་བ་དང་། །མོན་པ་ཨ་ཙ་ར་དང་ནི། །དགེ་བཤེས་བནྡེ་སློབ་དཔོན་དང་། །འོད་དང་སྒྲ་དང་ཁང་པ་འཚེག །མགོན་པོའི་སྐུ་དག་དངོས་སུ་མཐོང་། །
en: A raven will take flight and circle, And tribal people, mendicants, Spiritual friends, venerable ones, and masters “Will all perceive the Lord’s light, sound, Walled palace, and body before them.

source: དགྲ་ལ་དམག་དྲངས་སེམས་ཅན་བསད། །མི་ནག་བདག་ལ་སྙིང་སྟོབས་དང་། །མཛེ་པོ་དང་ནི་སྤྲང་པོ་དང་། །བྱ་ནག་ཐང་ལ་ལྷུང་བ་འབྱུང་། །
en: The being leading the enemy’s army will be killed. Ordinary people will gain confidence. “Lepers and beggars will arise, as will Ravens that have alighted in a field.”

source: དཔལ་མགོན་པོ་ནག་པོ་ནག་པོའི་རྒྱུད་ལས་རྟགས་ཀྱི་རིམ་པའི་ལེའུ་སྟེ་དྲུག་པའོ།། །།
en: This is chapter 6 in “The Tantra of Glorious Mahākāla” on “A Series of Signs of Accomplishment.” Chapter 7: Hailstorms

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །སེར་བ་དབབ་པའི་ལས་བྱ་ན། །
en: “Next, I will teach the following: To perform a rite to make it hail,

source: མོན་ནམ་མཛེ་ཅན་ཐོད་པ་རུ། །འཁོར་ལོ་རྩིབས་བཞི་བྲིས་ནས་ཀྱང་། །རིགས་ལྔ་ཀླུ་ཡི་ས་བོན་དགོད། །
en: Draw a wheel with four spokes In the skull of a tribal person or a leper. “Inscribe it with the seed syllables of the five classes of nāgas.

source: རྩིབས་ཆེན་སེར་སྲུང་མིང་རུས་དང་། །ཡུལ་དུ་ཕོབ་ཅིས་བྱ་བ་བྲིས། །
en: The large spokes should bear the name and family names of the hail protectors And have the phrase ‘fall in this country’ written on them.

source: དེ་མཐར་འཁོར་ལོ་རྩིབས་དགུ་ལ། །དྲེགས་པའི་སྔགས་དག་བྲི་བར་བྱ། །
en: Write the mantras of the arrogant spirit beings “On a wheel with nine spokes outside of that.

source: རྒྱབ་ཏུ་གང་ཡིན་ཡུལ་མིང་དང་། །རླུང་གི་སྙིང་པོ་བྲི་བར་བྱ། །
en: Write the name of the country and The wind heart mantra on the back side.

source: བདག་ཉིད་པདྨ་ཁྲོས་པར་བསྒོམ། །
en: Visualize yourself as Wrathful Lotus

source: གསང་སྔགས་འདི་ཡིས་གནད་ལ་བོར། །
en: “And strike their vital points using this mantra:

source: ཨོཾ་བཛྲ་མ་ཧཱ་ཀཱ་ལ་ཀྵིཾ་ཀྵེ་ཏྲ་བིགྷྣཱྃ་བི་ནཱ་ཡ་ཀ་ཧཱུྃ་ཧཱུྃ་ཕཊ། ནཱ་ག་སྙིང་གཟིར།
en: oṃ vajramahākāla kṣiṃ kṣetravighnān vināyaka hūṁ hūṁ phaṭ | torment the nāga’s mind | phu create obstacles ja khroṃ śar hril bhyo | “Recite that mantra while

source: ཕུ་ཧུར་ཐུམ་ཛ་ཁྲོ་ཤར་ཧྲིལ་བྷྱོ། །དེ་སྐད་ཅེས་ནི་རབ་བརྗོད་ལ། །ཡུངས་ཀར་ཡུངས་ནག་སྐེ་ཚེ་དང་། །ཁྲག་དང་དུག་གིས་ཐོད་པར་བྲབ། །ལོ་འབྲས་རླུང་ཁྱེར་རྟགས་བྱུང་ན
en: Pelting the skull with white and black Mustard seeds, blood, and poison. “If a gust of wind carries off the harvest, it is a sign

source: དགྲ་ཡི་ཡུལ་དུ་དབབ་པར་བྱ། །
en: That hail will fall in the enemy’s country.

source: གལ་ཏེ་འཇིག་རྟེན་ཕུང་བའོ། །
en: If it does, it will bring ruin to the people.”

source: དཔལ་མགོན་པོ་ནག་པོའི་རྒྱུད་ལས་སེར་བ་དབབ་པའི་ལེའུ་སྟེ་བདུན་པའོ།། །།
en: This is chapter 7 in “The Tantra of Glorious Mahākāla” on “Hailstorms.” Chapter 8

source: དེ་ནས་ཡང་དག་ངེས་གསུངས་པ། །ཨེ་མ་འཁོར་འདུས་ངོ་མཚར་ཅན། །མ་འོངས་དམ་ཅན་སྒྲུབ་བྱེད་ན། །
en: Then he gave the following definitive instruction: “Marvelous ones gathered in this assembly, In the future, when samaya holders perform this sādhana,

source: དམ་ཚིག་ལ་གནས་སྡོམ་པ་གཟུང་། །
en: They should maintain the samayas, uphold the vows, “And diligently perform the bali offerings.

source: གཏོར་མ་དག་ལ་བརྩོན་པར་བྱ། །
en: They should wear the samaya substances and soul stones on their body.”

source: དམ་རྫས་བླ་རྡོ་ལུས་ལ་བསྲེལ། །ཞེས་གསུངས་པས་རྒྱལ་པོ་མིག་མི་བཟང་ལ་སོགས་པའི་འཁོར་རྣམས་ཡི་རངས་ནས། ནག་པོ་ཆེན་པོས་བསྟན་པ་སྲུང་བར་ཁས་བླངས་ནས་མི་སྣང་བར་གྱུར་ཏོ། །
en: After he said that, King Virūpakṣa along with the rest of the assembly rejoiced, promised to maintain Mahākāla’s teaching, and then vanished.

source: དཔལ་ནག་པོ་ཆེན་པོའི་རྒྱུད་ལས་ལེའུ་བརྒྱད་པ་རྫོགས་སོ།། །།
en: This concludes chapter 8 in “The Tantra of Glorious Mahākāla.”

source: །​།རྒྱ་གར་གྱི་མཁན་པོ་ཨ་མོ་གྷ་བཛྲ་དང་། བོད་ཀྱི་ལོ་ཙྪ་བ་ཕུར་བུ་འོད་ཀྱིས་བསྒྱུར་བའོ།​།
en: This text was translated by the Indian preceptor Amoghavajra and the Tibetan translator Phurbu Ö.
